{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import (config, StructuredNode, StringProperty, IntegerProperty,\n",
    "    UniqueIdProperty, RelationshipTo, RelationshipFrom, db)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "config.DATABASE_URL = 'bolt://neo4j:test@neo4j:7687' \n",
    "#config.ENCRYPTED_CONNECTION = False\n",
    "config.AUTO_INSTALL_LABELS = True # adds constrain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "## delete all nodes and relationships\n",
    "# db.cypher_query(\n",
    "# \"MATCH (n) DETACH DELETE n\"\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[<Node id=0 labels={'Person'} properties={'name': 'Prayson', 'description': \"The Matrix's Neo\", 'age': 34}>],\n",
       "  [<Node id=1 labels={'Person'} properties={'name': 'Lea', 'description': 'The awesome', 'age': 32}>],\n",
       "  [<Node id=2 labels={'Person'} properties={'name': 'Eloise', 'description': 'The dancer', 'age': 8}>]],\n",
       " ['n'])"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\n",
    "\"MATCH (n) RETURN n LIMIT 3\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db._NODE_CLASS_REGISTRY "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# db._NODE_CLASS_REGISTRY = {}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Country(StructuredNode):\n",
    "    code = StringProperty(unique_index=True, required=True)\n",
    "    name = StringProperty(unique_index=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Person(StructuredNode):\n",
    "    #uid = UniqueIdProperty()\n",
    "    name = StringProperty(unique_index=True)\n",
    "    age = IntegerProperty(index=True, default=0)\n",
    "    description = StringProperty()\n",
    "\n",
    "    # traverse outgoing IS_FROM relations, inflate to Country objects\n",
    "    country = RelationshipTo(Country, 'IS_FROM')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Location(StructuredNode):\n",
    "    address = StringProperty(unique_index=True)\n",
    "    \n",
    "    leaves = RelationshipFrom(Person, 'LEAVES_IN')\n",
    "    is_in = RelationshipTo(Country, 'IS_IN')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "#del db._NODE_CLASS_REGISTRY[frozenset({'Person'})]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[':`Location`', ['Location'], 'address', ['String'], True],\n",
       "  [':`Person`', ['Person'], 'name', ['String'], True],\n",
       "  [':`Person`', ['Person'], 'description', ['String'], False],\n",
       "  [':`Person`', ['Person'], 'age', ['Long'], True]],\n",
       " ['nodeType', 'nodeLabels', 'propertyName', 'propertyTypes', 'mandatory'])"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\n",
    "\"CALL db.schema.nodeTypeProperties()\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "kenneth = Person(name='Kenneth', age=36).save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "country = Country(code='DK').save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "address = Location(address='Amager').save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kenneth.country.connect(country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "address.leaves.connect(kenneth)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "address.is_in.connect(country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create_or_udate == MERGE(No duplicates) while without it == CREATE (duplicates)\n",
    "# people = Person.create_or_update(\n",
    "#     {'name': 'Tim', 'age': 83},\n",
    "#     {'name': 'Bob', 'age': 23},\n",
    "#     {'name': 'Jill', 'age': 34},\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Person: {'name': 'Prayson', 'age': 34, 'description': \"The Matrix's Neo\", 'id': 0}>,\n",
       " <Person: {'name': 'Lea', 'age': 32, 'description': 'The awesome', 'id': 1}>,\n",
       " <Person: {'name': 'Eloise', 'age': 8, 'description': 'The dancer', 'id': 2}>,\n",
       " <Person: {'name': 'Nora', 'age': 5, 'description': 'The wise', 'id': 3}>,\n",
       " <Person: {'name': 'Mario', 'age': 3, 'description': 'The Jumper', 'id': 4}>,\n",
       " <Person: {'name': 'Wilfred', 'age': 59, 'description': 'Babu', 'id': 20}>,\n",
       " <Person: {'name': 'Eric', 'age': 35, 'description': 'First blood', 'id': 21}>,\n",
       " <Person: {'name': 'Jimmy', 'age': 29, 'description': 'Quantum MD', 'id': 22}>,\n",
       " <Person: {'name': 'Trace', 'age': 10, 'description': None, 'id': 23}>,\n",
       " <Person: {'name': 'Trisher', 'age': 3, 'description': None, 'id': 24}>,\n",
       " <Person: {'name': 'Kenneth', 'age': 36, 'description': None, 'id': 40}>]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return all nodes\n",
    "all_nodes = Person.nodes.all()\n",
    "all_nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "mario = Person.nodes.get(name='Mario')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "('Mario', 'The Jumper')"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mario.name, mario.description"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "kenneth = Person.nodes.get(name='Kenneth')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kenneth.delete()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "gurrevej = Location.nodes.get(address='Gurrevej 48')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Location: {'address': 'Gurrevej 48', 'id': 5}>"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gurrevej"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gurrevej.is_in.connect(country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "country.name = 'Denmark'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Country: {'code': 'DK', 'name': 'Denmark', 'id': 41}>"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "country.save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
