{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import (config, StructuredNode, StringProperty, IntegerProperty,\n",
    "    UniqueIdProperty, RelationshipTo, RelationshipFrom, db)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "config.DATABASE_URL = 'bolt://neo4j:test@neo4j:7687' \n",
    "#config.ENCRYPTED_CONNECTION = False\n",
    "config.AUTO_INSTALL_LABELS = True # adds constrain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "## delete all nodes and relationships\n",
    "# db.cypher_query(\n",
    "# \"MATCH (n) DETACH DELETE n\"\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([], ['n'])"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\n",
    "\"MATCH (n) RETURN n LIMIT 3\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db._NODE_CLASS_REGISTRY "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# db._NODE_CLASS_REGISTRY = {}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " + Creating unique constraint for code on label Country for class __main__.Country\n",
      "An equivalent constraint already exists, 'Constraint( UNIQUE, :Country(code) )'.\n",
      " + Creating unique constraint for name on label Country for class __main__.Country\n",
      "An equivalent constraint already exists, 'Constraint( UNIQUE, :Country(name) )'.\n"
     ]
    },
    {
     "ename": "ClassAlreadyDefined",
     "evalue": "Class __main__.Country with labels Country already defined:\n{frozenset({'Country'}): <class '__main__.Country'>, frozenset({'Person'}): <class '__main__.Person'>, frozenset({'Address'}): <class '__main__.Address'>, frozenset({'Location'}): <class '__main__.Location'>}\n",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mClassAlreadyDefined\u001b[0m                       Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-15-80788cbd8375>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0;32mclass\u001b[0m \u001b[0mCountry\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mStructuredNode\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m     \u001b[0mcode\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mStringProperty\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0munique_index\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mrequired\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m     \u001b[0mname\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mStringProperty\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0munique_index\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/opt/conda/lib/python3.7/site-packages/neomodel/core.py\u001b[0m in \u001b[0;36m__new__\u001b[0;34m(mcs, name, bases, namespace)\u001b[0m\n\u001b[1;32m    200\u001b[0m                 \u001b[0mdb\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_NODE_CLASS_REGISTRY\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mlabel_set\u001b[0m\u001b[0;34m]\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mcls\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    201\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 202\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mClassAlreadyDefined\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcls\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdb\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_NODE_CLASS_REGISTRY\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    203\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    204\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mcls\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mClassAlreadyDefined\u001b[0m: Class __main__.Country with labels Country already defined:\n{frozenset({'Country'}): <class '__main__.Country'>, frozenset({'Person'}): <class '__main__.Person'>, frozenset({'Address'}): <class '__main__.Address'>, frozenset({'Location'}): <class '__main__.Location'>}\n"
     ]
    }
   ],
   "source": [
    "class Country(StructuredNode):\n",
    "    code = StringProperty(unique_index=True, required=True)\n",
    "    name = StringProperty(unique_index=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " + Creating unique constraint for name on label Person for class __main__.Person\n",
      "An equivalent constraint already exists, 'Constraint( UNIQUE, :Person(name) )'.\n",
      " + Creating index age on label Person for class __main__.Person\n",
      "An equivalent index already exists, 'Index( 9, 'index_50166b1e', GENERAL BTREE, :Person(age), native-btree-1.0 )'.\n"
     ]
    }
   ],
   "source": [
    "class Person(StructuredNode):\n",
    "    #uid = UniqueIdProperty()\n",
    "    name = StringProperty(unique_index=True)\n",
    "    age = IntegerProperty(index=True, default=0)\n",
    "    description = StringProperty()\n",
    "\n",
    "    # traverse outgoing IS_FROM relations, inflate to Country objects\n",
    "    country = RelationshipTo(Country, 'IS_FROM')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " + Creating unique constraint for address on label Location for class __main__.Location\n"
     ]
    }
   ],
   "source": [
    "class Location(StructuredNode):\n",
    "    address = StringProperty(unique_index=True)\n",
    "    \n",
    "    leaves = RelationshipFrom(Person, 'LEAVES_IN')\n",
    "    is_in = RelationshipTo(Country, 'IS_IN')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "#del db._NODE_CLASS_REGISTRY[frozenset({'Person'})]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([[':`Person`', ['Person'], 'name', ['String'], True],\n",
       "  [':`Person`', ['Person'], 'age', ['Long'], True],\n",
       "  [':`Person`', ['Person'], 'description', ['String'], True],\n",
       "  [':`Location`', ['Location'], 'address', ['String'], True]],\n",
       " ['nodeType', 'nodeLabels', 'propertyName', 'propertyTypes', 'mandatory'])"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.cypher_query(\n",
    "\"CALL db.schema.nodeTypeProperties()\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "kenneth = Person(name='Kenneth', age=36).save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "country = Country(code='DK').save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "address = Location(address='Amager').save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kenneth.country.connect(country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "address.leaves.connect(kenneth)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "address.is_in.connect(country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create_or_udate == MERGE(No duplicates) while without it == CREATE (duplicates)\n",
    "# people = Person.create_or_update(\n",
    "#     {'name': 'Tim', 'age': 83},\n",
    "#     {'name': 'Bob', 'age': 23},\n",
    "#     {'name': 'Jill', 'age': 34},\n",
    "# )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Person: {'name': 'Kenneth', 'age': 36, 'description': None, 'id': 0}>,\n",
       " <Person: {'name': 'Prayson', 'age': 34, 'description': \"The Matrix's Neo\", 'id': 206}>,\n",
       " <Person: {'name': 'Lea', 'age': 32, 'description': 'The awesome', 'id': 207}>,\n",
       " <Person: {'name': 'Eloise', 'age': 8, 'description': 'The dancer', 'id': 208}>,\n",
       " <Person: {'name': 'Nora', 'age': 5, 'description': 'The wise', 'id': 209}>,\n",
       " <Person: {'name': 'Mario', 'age': 3, 'description': 'The Jumper', 'id': 210}>]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return all nodes\n",
    "all_nodes = Person.nodes.all()\n",
    "all_nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "mario = Person.nodes.get(name='Mario')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "('Mario', 'The Jumper')"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mario.name, mario.description"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "kenneth = Person.nodes.get(name='Kenneth')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kenneth.delete()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "gurrevej = Location.nodes.get(address='Gurrevej 48')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Location: {'address': 'Gurrevej 48', 'id': 211}>"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gurrevej"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gurrevej.is_in.connect(country)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "country.name = 'Denmark'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Country: {'code': 'DK', 'name': 'Denmark', 'id': 2}>"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "country.save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
